[
    {
        "id": "tcs",
        "title": "TCS",
        "period": "2020 - present",
        "content": "In Tata Consultancy Services, the client I am working with is Paypal Inc where I work along with the engineers to add value to the customer facing web application with highest quality.",
        "direction": "left"
    },
    {
        "id": "oracle",
        "title": "Oracle Corporation",
        "period": "2016 - 2020",
        "content": "Oracle is the third organization that I'm working with in my career. Here, I am working on a powerful tool for Global Project Management in Construction & Engineering domain. I am also part of other web based applications in the same department. All these web apps are using the latest Javacript technologies, including React, Node.js & Express, Mongoose, ES6 with babel & webpack and ES5 with grunt & Require.JS. I am the lead front-end developer for this product, and my responsibilities includes collection of requirements from analysts, creating designs, code, create unit tests and fixing bugs. I am an active communicator with all the stakeholders of this product for technical or non-technical matters.",
        "direction": "right"
    },
    {
        "id": "lti",
        "title": "LTI - L&T",
        "period": "2015 - 2016",
        "content": "I worked in Larsen & Toubro Infotech Limited for a short duration. My client was a leading US based media client where I worked on a web based data analysis tool that evaluates financial parameters based on the data inputed. We used MEAN stack with Angular 1, Mongodb, Express and Node for the development of this project. I was a senior developer, and my duties involved designing, coding and unit testing.",
        "direction": "left"
    },
    {
        "id": "infy",
        "title": "Infosys",
        "period": "2011 - 2015",
        "content": "Infosys is where I started my professional life. This is where I learned the basics of programming. The training I was given during the initial days paved the foundation for my career. In Infosys, I was part of a project management web application which was developed in ES5 with requirejs in front-end and Node js in the backend. This application was used by the client who is a leading banker in the United States.",
        "direction": "right"
    },
    {
        "id": "mca",
        "title": "Amrita University",
        "period": "2008 - 2011",
        "content": "Graduated with my masters degree in Computer Applications with a CGPA of 9.19 out of 10. I was one of the top students with a University rank of 4. Just like in academics, I excelled in other fields also. I was an active member of many students association activities and organisations.",
        "direction": "left"
    },
    {
        "id": "bsc",
        "title": "Amrita University",
        "period": "2005 - 2008",
        "content": "Under Graduate course- Bachelor of Science in Computer Science. I scored an 8.93 out of 10 and end up being the Uni second rank. That was a great learning time, and I met new people and had amazing life experiences.",
        "direction": "right"
    }
]